In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [3]:
%%sql
select * from test.players

 * mysql+mysqlconnector://tushar:***@localhost
9 rows affected.

   player_id  group_id
0         15         1
1         25         1
2         30         1
3         45         1
4         10         2
5         35         2
6         50         2
7         20         3
8         40         3

In [6]:
%%sql
select * from test.matches

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.

   match_id  first_player  second_player  first_score  second_score
0         1            15             45            3             0
1         2            30             25            1             2
2         3            30             15            2             0
3         4            40             20            5             2
4         5            35             50            1             1

In [22]:
%%sql

with total_scores as(
select player, group_id, sum(score) as total_score
from(
select first_player as player, group_id, first_score as score
from test.matches m join
test.players p on m.first_player = p.player_id
union all
select second_player as player, group_id, second_score as score
from test.matches m join
test.players p on m.first_player = p.player_id) temp group by 1,2)
select * from (
select *, rank() over(partition by group_id order by total_score desc, player asc) as rank_
from total_scores) tmp where rank_=1

 * mysql+mysqlconnector://tushar:***@localhost
3 rows affected.

   player  group_id total_score  rank_
0      15         1           3      1
1      35         2           1      1
2      40         3           5      1

In [23]:
%%sql df_players <<
select * from test.players

 * mysql+mysqlconnector://tushar:***@localhost
9 rows affected.
Returning data to local variable df_players

In [24]:
%%sql df_matches <<
select * from test.matches

 * mysql+mysqlconnector://tushar:***@localhost
5 rows affected.
Returning data to local variable df_matches

In [47]:
df_players_score_1 = df_matches[['first_player','first_score']]
df_players_score_1.columns = ['player','score']
df_players_score_2 = df_matches[['second_player','second_score']]
df_players_score_2.columns = ['player','score']

all_scores = pd.concat([df_players_score_1, df_players_score_2])
all_scores = all_scores.groupby('player')['score'].sum()
all_scores = pd.merge(all_scores, df_players, left_on='player', right_on='player_id')
all_scores = all_scores[['player_id', 'group_id', 'score']]
print(all_scores)
all_scores['rank'] = all_scores.groupby(['group_id'])['score'].rank(ascending=False)
all_scores

#all_scores.groupby('player')['score'].sum()

   player_id  group_id  score
0         15         1      3
1         20         3      2
2         25         1      2
3         30         1      3
4         35         2      1
5         40         3      5
6         45         1      0
7         50         2      1

   player_id  group_id  score  rank
0         15         1      3   1.5
1         20         3      2   2.0
2         25         1      2   3.0
3         30         1      3   1.5
4         35         2      1   1.5
5         40         3      5   1.0
6         45         1      0   4.0
7         50         2      1   1.5